{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-12\n",
      "11111140.0\n",
      "y=  11111110.0\n"
     ]
    }
   ],
   "source": [
    "# Задание-1: уравнение прямой вида y = kx + b задано в виде строки.\n",
    "# Определить координату y точки с заданной координатой x.\n",
    "\n",
    "equation = 'y = -12x + 11111140.2121'\n",
    "x = 2.5\n",
    "# вычислите и выведите y\n",
    "\n",
    "import re\n",
    "equation = equation.replace(' ','')\n",
    "str = re.findall(r'[-/+]\\d+',equation)\n",
    "k = int(str[0])\n",
    "b = float(str[1])\n",
    "print(k)\n",
    "print(b)\n",
    "print(\"y= \", k * x + b)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Некорректно введена дата\n"
     ]
    }
   ],
   "source": [
    "# Задание-2: Дата задана в виде строки формата 'dd.mm.yyyy'.\n",
    "# Проверить, корректно ли введена дата.\n",
    "# Условия корректности:\n",
    "# 1. День должен приводиться к целому числу в диапазоне от 1 до 30(31)\n",
    "#  (в зависимости от месяца, февраль не учитываем)\n",
    "# 2. Месяц должен приводиться к целому числу в диапазоне от 1 до 12\n",
    "# 3. Год должен приводиться к целому положительному числу в диапазоне от 1 до 9999\n",
    "# 4. Длина исходной строки для частей должна быть в соответствии с форматом \n",
    "#  (т.е. 2 символа для дня, 2 - для месяца, 4 - для года)\n",
    "\n",
    "# Пример корректной даты\n",
    "#date = '01.11.1985'\n",
    "\n",
    "# Примеры некорректных дат\n",
    "#date = '01.22.1001'\n",
    "#date = '1.12.1001'\n",
    "date = '-2.10.3001'\n",
    "\n",
    "lst = date.split(sep='.')\n",
    "correct = 0\n",
    "correct += 1 if (len(lst[0]) == 2) and (int(lst[0]) >= 1 and (int(lst[0]) <= 30 or int(lst[0]) <= 31)) else 0\n",
    "correct += 1 if (len(lst[1]) == 2) and (int(lst[1]) >= 1 and int(lst[1])) <= 12  else 0\n",
    "correct += 1 if (len(lst[2]) == 4) and (int(lst[2]) >= 1 and int(lst[2])) <= 9999  else 0\n",
    "print('Коректная дата') if correct == 3 else print(\"Некорректно введена дата\")            "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[[1],\n",
       " [2, 3],\n",
       " [4, 5],\n",
       " [6, 7, 8],\n",
       " [9, 10, 11],\n",
       " [12, 13, 14],\n",
       " [15, 16, 17, 18],\n",
       " [19, 20, 21, 22],\n",
       " [23, 24, 25, 26],\n",
       " [27, 28, 29, 30]]"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Задание-3: \"Перевёрнутая башня\" (Задача олимпиадного уровня)\n",
    "#\n",
    "# Вавилонцы решили построить удивительную башню —\n",
    "# расширяющуюся к верху и содержащую бесконечное число этажей и комнат.\n",
    "# Она устроена следующим образом — на первом этаже одна комната,\n",
    "# затем идет два этажа, на каждом из которых по две комнаты, \n",
    "# затем идёт три этажа, на каждом из которых по три комнаты и так далее:\n",
    "#         ...\n",
    "#     12  13  14\n",
    "#     9   10  11\n",
    "#     6   7   8\n",
    "#       4   5\n",
    "#       2   3\n",
    "#         1\n",
    "#\n",
    "# Эту башню решили оборудовать лифтом --- и вот задача:\n",
    "# нужно научиться по номеру комнаты определять,\n",
    "# на каком этаже она находится и какая она по счету слева на этом этаже.\n",
    "#\n",
    "# Входные данные: В первой строчке задан номер комнаты N, 1 ≤ N ≤ 2 000 000 000.\n",
    "#\n",
    "# Выходные данные:  Два целых числа — номер этажа и порядковый номер слева на этаже.\n",
    "#\n",
    "# Пример:\n",
    "# Вход: 13\n",
    "# Выход: 6 2\n",
    "#\n",
    "# Вход: 11\n",
    "# Выход: 5 3\n",
    "\n",
    "\n",
    "# Представим башню в виде структуры:\n",
    "# список nl = [a1, a2, a3, ..., ai, ...ak]\n",
    "#       где ai = [b1,b2,b3,...,bj,...bl] - описывает этаж \n",
    "#            где bj - номер квартиры на этаже\n",
    "#\n",
    "#  т.е nl = [ [1], [2,3], [4,5], [6,7,8], ... ]\n",
    "#         [4,5] - описывает 3 этаж\n",
    "#             4 - номер квартиры на этаже\n",
    "# \n",
    "#\n",
    "#\n",
    "\n",
    "# Создаем список nl с максимальной размерностью n (здесь n = 5)\n",
    "n = 5\n",
    "nl = []\n",
    "h = 0\n",
    "st = 1\n",
    "vl = []\n",
    "\n",
    "for i in range(2,n+1):\n",
    "    h = 1\n",
    "    while h < i:\n",
    "        for j in range(1,i):\n",
    "            vl.append(st)\n",
    "            st += 1\n",
    "        nl.append(vl)\n",
    "        vl = []\n",
    "        h += 1\n",
    "        \n",
    "nl"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите номер квартиры: 11\n",
      "5 3\n"
     ]
    }
   ],
   "source": [
    "# Тогда решение задачи будет\n",
    "room = int(input(\"Введите номер квартиры: \"))\n",
    "for i in nl:\n",
    "    for j in i:\n",
    "        if j == room:\n",
    "            floor = nl.index(i)+1\n",
    "            sm = i.index(room)+1\n",
    "print(floor, sm)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
